<a href="https://colab.research.google.com/github/mehedihasanreal/Learn_Pandas_With_Mehedi/blob/main/Learn_Pandas_With_Mehedi.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# firstly import Pandas in a short form "pd"
import pandas as pd

In [2]:
# data table
# creating DataFrame
info = pd.DataFrame({'Departement': ['BCSE', 'BsAg'], 
              'Address': ['Cumilla', 'Rajshahi'],
              'CGPA' : ['351','381']},
              index = ['Real', 'Nasim'])
info

      Departement   Address CGPA
Real         BCSE   Cumilla  351
Nasim        BsAg  Rajshahi  381

In [3]:
# we can create directly or we can create using dictionary
# first create a dictionary as Python
dict1 = {
    "Name":["Real",'Nasim','Anamika','Tusher','Zubaer'],
    "Marks":[50,55,60,70,75],
    "Address":['Cumilla','Rajshahi','Mymensingh','Dhaka','Jessore']
}
# converting "dict1" into DataFrame and put into a variable
info1 = pd.DataFrame(dict1)
# call the variable for output
info1

      Name  Marks     Address
0     Real     50     Cumilla
1    Nasim     55    Rajshahi
2  Anamika     60  Mymensingh
3   Tusher     70       Dhaka
4   Zubaer     75     Jessore

In [4]:
# Series is another object in Pandas
info_series = pd.Series([3.8, 3.6, 3.7], index=['Summer 2021', 'Spring 2021', 'Fall 2021'], name='Real')
info_series

Summer 2021    3.8
Spring 2021    3.6
Fall 2021      3.7
Name: Real, dtype: float64

In [5]:
info1.to_csv("Student.csv", index = False)
info1.describe()

           Marks
count   5.000000
mean   62.000000
std    10.368221
min    50.000000
25%    55.000000
50%    60.000000
75%    70.000000
max    75.000000

In [6]:
# first two row of the table
info1.head(2)

    Name  Marks   Address
0   Real     50   Cumilla
1  Nasim     55  Rajshahi

In [7]:
# last two row of the table
info1.tail(2)

     Name  Marks  Address
3  Tusher     70    Dhaka
4  Zubaer     75  Jessore

In [8]:
# read the DataFrame
# We'll use the pd.read_csv() function to read the data into a DataFrame. 
read = pd.read_csv("/content/Student.csv")
read.describe()

           Marks
count   5.000000
mean   62.000000
std    10.368221
min    50.000000
25%    55.000000
50%    60.000000
75%    70.000000
max    75.000000

In [9]:
# We can use the shape attribute to check how large the resulting DataFrame is
read.shape
# 5 splitts in 3 different coloumn

(5, 3)

In [10]:
# maximum property of the DataFrame
read.max()

Name         Zubaer
Marks            75
Address    Rajshahi
dtype: object

In [11]:
# find any specific column
read['Address']

0       Cumilla
1      Rajshahi
2    Mymensingh
3         Dhaka
4       Jessore
Name: Address, dtype: object

In [12]:
# for find out any specific data from table
read['Address'][0]

'Cumilla'

In [13]:
# indexing in Pandas : *loc *iloc
# index based selection : iloc
read.iloc[0] # first row

Name          Real
Marks           50
Address    Cumilla
Name: 0, dtype: object

In [14]:
# finding all elements of the first column
read.iloc[:, 0]

0       Real
1      Nasim
2    Anamika
3     Tusher
4     Zubaer
Name: Name, dtype: object

In [15]:
# from index = 1 to index = 3 in first column 
read.iloc[1:3, 0]

1      Nasim
2    Anamika
Name: Name, dtype: object

In [16]:
# finding from the last row all elements
read.iloc[-2:]

     Name  Marks  Address
3  Tusher     70    Dhaka
4  Zubaer     75  Jessore

In [17]:
# label based selection: loc
# finding first element from "Name" column
read.loc[0, 'Name']

'Real'

In [18]:
# finding all elements from "Name" and "Marks" column
read.loc[:, ['Name', 'Marks']]

      Name  Marks
0     Real     50
1    Nasim     55
2  Anamika     60
3   Tusher     70
4   Zubaer     75

In [ ]:
# iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. So 0:10 will select entries 0,...,9.
# loc, meanwhile, indexes inclusively. So 0:10 will select entries 0,...,10.

In [19]:
# we can add index separately
info1.index=['First','Second','Third','Fourth','Fifth']
info1

           Name  Marks     Address
First      Real     50     Cumilla
Second    Nasim     55    Rajshahi
Third   Anamika     60  Mymensingh
Fourth   Tusher     70       Dhaka
Fifth    Zubaer     75     Jessore

In [20]:
# this is called index manipulating
info1.set_index('Name')

         Marks     Address
Name
Real        50     Cumilla
Nasim       55    Rajshahi
Anamika     60  Mymensingh
Tusher      70       Dhaka
Zubaer      75     Jessore

In [21]:
# Conditional Selection
read.Name == 'Real'

0     True
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [22]:
# This operation produced a Series of True/False booleans based on the Name of each record.
# This result can then be used inside of loc to select the relevant data.
# Here we can use more than one condition using "&", "|"
read.loc[read.Name == 'Real']

   Name  Marks  Address
0  Real     50  Cumilla

In [23]:
# isin is lets us select data whose value "is in" a list of values
read.loc[read.Name.isin(['Real', 'Nasim'])]

    Name  Marks   Address
0   Real     50   Cumilla
1  Nasim     55  Rajshahi

In [24]:
# These methods let you highlight values which are (or are not) empty (NaN)
read.loc[read.Marks.notnull()]

      Name  Marks     Address
0     Real     50     Cumilla
1    Nasim     55    Rajshahi
2  Anamika     60  Mymensingh
3   Tusher     70       Dhaka
4   Zubaer     75     Jessore

In [25]:
# assigning data to a DataFrame is easy.
read['Status'] = 'Good'
read['Status']
read

      Name  Marks     Address Status
0     Real     50     Cumilla   Good
1    Nasim     55    Rajshahi   Good
2  Anamika     60  Mymensingh   Good
3   Tusher     70       Dhaka   Good
4   Zubaer     75     Jessore   Good

In [ ]:
# it will delete the irrelevant column
read.drop('critic', axis='columns', inplace=True)
read

In [27]:
# it will reverse the index
read['index_backwards'] = range(len(read), 0, -1)
read['index_backwards']

0    5
1    4
2    3
3    2
4    1
Name: index_backwards, dtype: int64

In [28]:
# in big data using this method we can show the rows as we want
pd.set_option('max_rows', 5)
read

      Name  Marks     Address Status  index_backwards
0     Real     50     Cumilla   Good                5
1    Nasim     55    Rajshahi   Good                4
2  Anamika     60  Mymensingh   Good                3
3   Tusher     70       Dhaka   Good                2
4   Zubaer     75     Jessore   Good                1

In [29]:
# Pandas provides many simple "summary functions" (not an official name),
# which restructure the data in some useful way
read.Marks.describe()

count     5.0
mean     62.0
         ...
75%      70.0
max      75.0
Name: Marks, Length: 8, dtype: float64

In [30]:
# to see the mean of the points allotted, we can use the mean() function
read.Marks.mean()

62.0

In [31]:
# To see a list of unique values we can use the unique() function: 
read.Address.unique()

array(['Cumilla', 'Rajshahi', 'Mymensingh', 'Dhaka', 'Jessore'],
      dtype=object)

In [32]:
# To see a list of unique values and 
# how often they occur in the dataset, we can use the value_counts() method:
read.Address.value_counts()

Dhaka         1
Jessore       1
Rajshahi      1
Cumilla       1
Mymensingh    1
Name: Address, dtype: int64

In [ ]:
# A map is a term, borrowed from mathematics, for a function that takes one set of
# values and "maps" them to another set of values.

In [33]:
# The function you pass to map() should expect a single value from the Series
# (a point value, in the example), and return a transformed version of that value
# map() returns a new Series where all the values have been transformed by your function.
read_marks_mean = read.Marks.mean()
read.Marks.map(lambda m: m - read_marks_mean)

0   -12.0
1    -7.0
2    -2.0
3     8.0
4    13.0
Name: Marks, dtype: float64

In [34]:
# apply() is the equivalent method if we want to transform a whole DataFrame by 
# calling a custom method on each row.
def remean_marks(row):
  row.Marks = row.Marks - read_marks_mean
  return row

read.apply(remean_marks, axis = 'columns')

      Name  Marks     Address Status  index_backwards
0     Real  -12.0     Cumilla   Good                5
1    Nasim   -7.0    Rajshahi   Good                4
2  Anamika   -2.0  Mymensingh   Good                3
3   Tusher    8.0       Dhaka   Good                2
4   Zubaer   13.0     Jessore   Good                1

In [35]:
# Pandas provides many common mapping operations as built-ins
read_marks_mean = read.Marks.mean()
read.Marks - read_marks_mean

0   -12.0
1    -7.0
2    -2.0
3     8.0
4    13.0
Name: Marks, dtype: float64

In [36]:
# an easy way of combining Name and Address information in the dataset
read.Name + " - " + read.Address

0          Real - Cumilla
1        Nasim - Rajshahi
2    Anamika - Mymensingh
3          Tusher - Dhaka
4        Zubaer - Jessore
dtype: object

In [37]:
# We can replicate what value_counts() does by doing the following:
read.groupby('Marks').Marks.count()

Marks
50    1
55    1
60    1
70    1
75    1
Name: Marks, dtype: int64

In [38]:
read.groupby('Address').Marks.min()

Address
Cumilla       50
Dhaka         70
Jessore       75
Mymensingh    60
Rajshahi      55
Name: Marks, dtype: int64

In [39]:
read.groupby('Name').apply(lambda df: df.Address.iloc[0])

Name
Anamika    Mymensingh
Nasim        Rajshahi
Real          Cumilla
Tusher          Dhaka
Zubaer        Jessore
dtype: object

In [40]:
# For even more fine-grained control, you can also group by more than one column
read.groupby(['Name', 'Address']).apply(lambda df: df.loc[df.Marks.idxmax()])

                       Name  Marks     Address Status  index_backwards
Name    Address
Anamika Mymensingh  Anamika     60  Mymensingh   Good                3
Nasim   Rajshahi      Nasim     55    Rajshahi   Good                4
Real    Cumilla        Real     50     Cumilla   Good                5
Tusher  Dhaka        Tusher     70       Dhaka   Good                2
Zubaer  Jessore      Zubaer     75     Jessore   Good                1

In [41]:
# Another groupby() method worth mentioning is agg(), which lets you run a
# bunch of different functions on your DataFrame simultaneously.
read.groupby(['Name']).Marks.agg([len, min, max])

         len  min  max
Name
Anamika    1   60   60
Nasim      1   55   55
Real       1   50   50
Tusher     1   70   70
Zubaer     1   75   75

In [42]:
# A multi-index differs from a regular index in that it has multiple levels
Name_read = read.groupby(['Name', 'Marks']).Address.agg([len])
Name_read

               len
Name    Marks
Anamika 60       1
Nasim   55       1
Real    50       1
Tusher  70       1
Zubaer  75       1

In [43]:
mi = Name_read.index
type(mi)

pandas.core.indexes.multi.MultiIndex

In [44]:
# To get data in the order want it in we can sort it ourselves. The sort_values() method is handy for this.
Name_read = Name_read.reset_index()
Name_read.sort_values(by='len')

      Name  Marks  len
0  Anamika     60    1
1    Nasim     55    1
2     Real     50    1
3   Tusher     70    1
4   Zubaer     75    1

In [45]:
Name_read.sort_values(by='len', ascending= False)

      Name  Marks  len
0  Anamika     60    1
1    Nasim     55    1
2     Real     50    1
3   Tusher     70    1
4   Zubaer     75    1

In [46]:
Name_read.sort_index()

      Name  Marks  len
0  Anamika     60    1
1    Nasim     55    1
2     Real     50    1
3   Tusher     70    1
4   Zubaer     75    1

In [47]:
# know that you can sort by more than one column at a time
Name_read.sort_values(by=['Name','len'])

      Name  Marks  len
0  Anamika     60    1
1    Nasim     55    1
2     Real     50    1
3   Tusher     70    1
4   Zubaer     75    1

In [48]:
# The data type for a column in a DataFrame or a Series is known as the dtype.
read.Marks.dtype

dtype('int64')

In [50]:
# the dtypes property returns the dtype of every column in the DataFrame.
read.dtypes

Name               object
Marks               int64
Address            object
Status             object
index_backwards     int64
dtype: object

In [51]:
# converting the datetype using astype()
read.Marks.astype('float64')

0    50.0
1    55.0
2    60.0
3    70.0
4    75.0
Name: Marks, dtype: float64

In [52]:
# A DataFrame or Series index has its own dtype
read.index.dtype

dtype('int64')

In [53]:
# Pandas provides some methods specific to missing data.
# To select NaN entries you can use pd.isnull()
# (or its companion pd.notnull()).
read[pd.isnull(read.Name)]

Empty DataFrame
Columns: [Name, Marks, Address, Status, index_backwards]
Index: []

In [55]:
# Replacing missing values is a common operation. Pandas provides a really handy method for this problem: fillna(). fillna() provides a few different strategies for mitigating such data.
read.Name.fillna("Unknown")

0       Real
1      Nasim
2    Anamika
3     Tusher
4     Zubaer
Name: Name, dtype: object

In [58]:
# if we dont have null value we can use replace  method
read.Name.replace('Zubaer','Arman')

0       Real
1      Nasim
2    Anamika
3     Tusher
4      Arman
Name: Name, dtype: object

In [59]:
# rename the column name
read.rename(columns={'Marks':'Score'})

      Name  Score     Address Status  index_backwards
0     Real     50     Cumilla   Good                5
1    Nasim     55    Rajshahi   Good                4
2  Anamika     60  Mymensingh   Good                3
3   Tusher     70       Dhaka   Good                2
4   Zubaer     75     Jessore   Good                1

In [60]:
# rename the inedex name also but 'set_index()' method is usually more convenient
read.rename(index={0 : 'firstEntry', 1 : 'secondEntry'})

                Name  Marks     Address Status  index_backwards
firstEntry      Real     50     Cumilla   Good                5
secondEntry    Nasim     55    Rajshahi   Good                4
2            Anamika     60  Mymensingh   Good                3
3             Tusher     70       Dhaka   Good                2
4             Zubaer     75     Jessore   Good                1

In [62]:
read.rename_axis("serial", axis='rows').rename_axis('fields', axis='columns')

fields     Name  Marks     Address Status  index_backwards
serial
0          Real     50     Cumilla   Good                5
1         Nasim     55    Rajshahi   Good                4
2       Anamika     60  Mymensingh   Good                3
3        Tusher     70       Dhaka   Good                2
4        Zubaer     75     Jessore   Good                1

In [70]:
# Pandas has three core methods for doing this. In order of increasing complexity, these are concat(), join(), and merge(). Most of what merge() can do can also be done more simply with join()
# The simplest combining method is concat()
info.to_csv("Student2.csv")
read2 = pd.read_csv("/content/Student2.csv")
read2
pd.concat([read, read])

      Name  Marks   Address Status  index_backwards
0     Real     50   Cumilla   Good                5
1    Nasim     55  Rajshahi   Good                4
..     ...    ...       ...    ...              ...
3   Tusher     70     Dhaka   Good                2
4   Zubaer     75   Jessore   Good                1

[10 rows x 5 columns]